app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "image", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["image", "test.jpg"], ["description", "test"], ["created_at", "2022-04-07 23:19:24.436870"], ["updated_at", "2022-04-07 23:19:24.436870"], ["user_id", 1]]